//Dropdown for oblasti

function configureDropDownLists(ddl1,ddl2) {
  var Сумська = new Array('Білопільський', 'Буринський', 'Великописарівський', 'Глухівський', 'Конотопський', 'Краснопільський', 'Кролевецький', 'Лебединський', 'Липоводолинський', 'Недригайлівський', 'Охтирський', 'Путивльський', 'Роменський', 'Середино-Будський', 'Сумський', 'Тростянецький', 'Шосткинський', 'Ямпільський');
  var Полтавська = new Array('Великобагачанський', 'Гадяцький', 'Глобинський', 'Гребінківський', 'Диканський', 'Зіньківський', 'Карлівський', 'Кобеляцький', 'Козельщинський', 'Котелевський', 'Кременчуцький', 'Лохвицький', 'Лубенський', 'Машівський', 'Миргородський', 'Новосанжарський', 'Оржицький', 'Пирятинський', 'Полтавський', 'Решетилівський', 'Семенівський', 'Хорольський', 'Чорнухинський', 'Чутівський', 'Шишацький');
  var Чернiгiвська = new Array('Бахмацький', ' Бобровицький', ' Борзнянський', ' Варвинський', ' Городнянський', ' Ічнянський', ' Козелецький', ' Коропський', ' Корюківський', ' Куликівський', ' Менський', ' Ніжинський', ' Новгород-Сіверський', ' Носівський', ' Прилуцький', ' Ріпкинський', ' Семенівський', ' Сосницький', ' Срібнянський', ' Талалаївський', ' Чернігівський', ' Щорський');
  var Курська = new Array('Беловский', ' Большесолдатский', ' Глушковский', ' Горшеченский', ' Дмитриевский', ' Железногорский', ' Золотухинский', ' Касторенский', ' Конышёвский', ' Кореневский', ' Курский', ' Курчатовский', ' Льговский', ' Мантуровский', ' Медвенский', ' Обоянский', ' Октябрьский', ' Поныровский', ' Пристенский', ' Рыльский', ' Советский', ' Солнцевский', ' Суджанский', ' Тимский', ' Фатежский', ' Хомутовский', ' Черемисиновский', ' Щигровский');
  var Брянська = new Array('Брасовский', ' Брянский', ' Выгоничский', ' Гордеевский', ' Дубровский', ' Дятьковский', ' Жирятинский', ' Жуковский', ' Злынковский', ' Карачевский', ' Клетнянский', ' Климовский', ' Клинцовский', ' Комаричский', ' Красногорский', ' Мглинский', ' Навлинский', ' Новозыбковский', ' Погарский', ' Почепский', ' Рогнединский', ' Севский', ' Стародубский', ' Суземский', ' Суражский', ' Трубчевский', ' Унечский');
  var Орловська = new Array('Болховский', ' Верховский', ' Глазуновский', ' Дмитровский', ' Должанский', ' Залегощенский', ' Знаменский', ' Колпнянский', ' Корсаковский', ' Краснозоренский', ' Кромской', ' Ливенский', ' Малоархангельский', ' Мценский', ' Новодеревеньковский', ' Новосильский', ' Орловский', ' Покровский', ' Свердловский', ' Сосковский', ' Троснянский', ' Урицкий', ' Хотынецкий', ' Шаблыкинский');
  switch (ddl1.value) {
    case 'Сумська':
      ddl2.options.length = 0;
      for (i = 0; i < Сумська.length; i++) {
        createOption(ddl2, Сумська[i], Сумська[i]);
      }
      break;

    case 'Полтавська':
      ddl2.options.length = 0;
      for (i = 0; i < Полтавська.length; i++) {
        createOption(ddl2, Полтавська[i], Полтавська[i]);
      }
      break;
    case 'Чернiгiвська':
      ddl2.options.length = 0; 
      for (i = 0; i < Чернiгiвська.length; i++) {
        createOption(ddl2, Чернiгiвська[i], Чернiгiвська[i]);
      }
      break;
    case 'Курська':
      ddl2.options.length = 0;
      for (i = 0; i < Курська.length; i++) {
        createOption(ddl2, Курська[i], Курська[i]);
      }
      break;
      case 'Брянська':
      ddl2.options.length = 0; 
      for (i = 0; i < Брянська.length; i++) {
        createOption(ddl2, Брянська[i], Брянська[i]);
      }
      break;
      case 'Орловська':
      ddl2.options.length = 0; 
      for (i = 0; i < Орловська.length; i++) {
        createOption(ddl2, Орловська[i], Орловська[i]);
      }
      break;

    default:
      ddl2.options.length = 0;
      break;
  }

};

function createOption(ddl, text, value) {
  var opt = document.createElement('option');
  opt.value = value;
  opt.text = text;
  ddl.options.add(opt);
};

//Slider
$(document).ready(function(){
  $('#slider').slider({});
  $('#slider').change(function(){
    var value = $('#slider').attr('value');
    $("#slider_v").attr("value", value);
  })
});
$(document).ready(function(){
  $('#slider2').slider({});
  $('#slider2').change(function(){
    var value = $('#slider2').attr('value');
    $("#slider_v2").attr("value", value);
  })
});

//var app = angular.module('app', ['flow'])
//

//initialize with defaults

$("#id_image").fileinput();
$("#input-6").fileinput({
        showUpload: false,
        maxFileCount: 10,
    });      
$("#input-61").fileinput({
        showUpload: false,
        maxFileCount: 10,
    });   
$("#input-62").fileinput({
        showUpload: false,
        maxFileCount: 10,
    });   

//var mySlider = $("input.slider").slider();
//var value = mySlider.slider('getValue')
$("#ex2").slider({});

