oblasti = {'Полтавська область':['Великобагачанський', 'Гадяцький', 'Глобинський', 'Гребінківський', 'Диканський', 'Зіньківський', 'Карлівський', 'Кобеляцький', 'Козельщинський', 'Котелевський', 'Кременчуцький', 'Лохвицький', 'Лубенський', 'Машівський', 'Миргородський', 'Новосанжарський', 'Оржицький', 'Пирятинський', 'Полтавський', 'Решетилівський', 'Семенівський', 'Хорольський', 'Чорнухинський', 'Чутівський', 'Шишацький']}

Сумська область: Білопільський, Буринський, Великописарівський, Глухівський, Конотопський, Краснопільський, Кролевецький, Лебединський, Липоводолинський, Недригайлівський, Охтирський, Путивльський, Роменський, Середино-Будський, Сумський, Тростянецький, Шосткинський, Ямпільський.

Чернігівська область: Бахмацький, Бобровицький, Борзнянський, Варвинський, Городнянський, Ічнянський, Козелецький, Коропський, Корюківський, Куликівський, Менський, Ніжинський, Новгород-Сіверський, Носівський, Прилуцький, Ріпкинський, Семенівський, Сосницький, Срібнянський, Талалаївський, Чернігівський, Щорський.

Курська область: Беловский, Большесолдатский, Глушковский, Горшеченский, Дмитриевский, Железногорский, Золотухинский, Касторенский, Конышёвский, Кореневский, Курский, Курчатовский, Льговский, Мантуровский, Медвенский, Обоянский, Октябрьский, Поныровский, Пристенский, Рыльский, Советский, Солнцевский, Суджанский, Тимский, Фатежский, Хомутовский, Черемисиновский, Щигровский.

Брянська область: Брасовский, Брянский, Выгоничский, Гордеевский, Дубровский, Дятьковский, Жирятинский, Жуковский, Злынковский, Карачевский, Клетнянский, Климовский, Клинцовский, Комаричский, Красногорский, Мглинский, Навлинский, Новозыбковский, Погарский, Почепский, Рогнединский, Севский, Стародубский, Суземский, Суражский, Трубчевский, Унечский, 

Орловська область: Болховский, Верховский, Глазуновский, Дмитровский, Должанский, Залегощенский, Знаменский, Колпнянский, Корсаковский, Краснозоренский, Кромской, Ливенский, Малоархангельский, Мценский, Новодеревеньковский, Новосильский, Орловский, Покровский, Свердловский, Сосковский, Троснянский, Урицкий, Хотынецкий, Шаблыкинский.
